app/controllers/app_versions_controller.rb

  def index
    @app_versions = @project.app_versions
    @android_versions = Array.new
    @ios_versions     = Array.new

    @app_versions.each do |app_version|
---
SELECT "app_versions".* FROM "app_versions" WHERE "app_versions"."project_id" = ?  [["project_id", 2]]

  def edit
    @app_version = @project.app_versions.find(params[:id])
---
SELECT "app_versions".* FROM "app_versions" WHERE "app_versions"."project_id" = ? AND "app_versions"."id" = ? LIMIT 1  [["project_id", 1], ["id", "14"]]

  def create
    @app_version = @project.app_versions.create(app_version_params)

    respond_to do |format|
      if @app_version.save
---
INSERT INTO "app_versions" ("app_ipa_content_type", "app_ipa_file_name", "app_ipa_file_size", "app_ipa_updated_at", "created_at", "notes", "project_id", "updated_at", "url_plist", "version", "version_icon_content_type", "version_icon_file_name", "version_icon_file_size", "version_icon_updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13, $14) RETURNING "id"
UPDATE "app_versions" SET "url_plist" = $1, "updated_at" = $2 WHERE "app_versions"."id" = 22  [["url_plist", "/Users/mmuse/RubymineProjects/RentPath/RentPathApps/public/plist/Apartments-asdfasdfdfsa.plist"], ["updated_at", Tue, 09 Jul 2013 14:17:17 UTC +00:00]]

  def update
    respond_to do |format|
      if @app_version.update(app_version_params)
---
UPDATE "app_versions" SET "version" = ?, "url_ipa" = ?, "url_icon" = ?, "url_plist" = ?, "notes" = ?, "updated_at" = ? WHERE "app_versions"."id" = 7  [["version", "rrrrrr"], ["url_ipa", "rrrrrr"], ["url_icon", "rrrrr"], ["url_plist", "rrrrr"], ["notes", "rrrrrr"], ["updated_at", Mon, 08 Jul 2013 16:06:01 UTC +00:00]]

  def destroy
    @app_version.destroy
---
DELETE FROM "app_versions" WHERE "app_versions"."id" = ?  [["id", 18]]

  def latest_version
    project = Project.find(params[:id])
    app_version = project.app_versions.last
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = $1 LIMIT 1  [["id", "6"]]
SELECT "app_versions".* FROM "app_versions" WHERE "app_versions"."project_id" = $1 ORDER BY "app_versions"."id" DESC LIMIT 1  [["project_id", 6]]

    def set_app_version
      @app_version = AppVersion.find(params[:id])
---
SELECT "app_versions".* FROM "app_versions" WHERE "app_versions"."id" = ? LIMIT 1  [["id", "18"]]

    def find_project
      @project = Project.find(params[:project_id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "2"]]