app/controllers/projects_controller.rb

  def create
    puts '*** ABOUT TO CREATE A NEW PROJECT ***'
    @project = Project.new(project_params)

    puts '*** ABOUT THE SAVE NEW PROJECT ***'
    respond_to do |format|
      if @project.save
---
INSERT INTO "projects" ("bundle_identifier", "created_at", "name", "project_icon_content_type", "project_icon_file_name", "project_icon_file_size", "project_icon_updated_at", "title", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9) RETURNING "id"

  def update
    respond_to do |format|
      if @project.update(project_params)
---
UPDATE "projects" SET "name" = $1, "project_icon_updated_at" = $2, "project_icon_file_name" = $3, "updated_at" = $4 WHERE "projects"."id" = 5  [["name", "AG QA"], ["project_icon_updated_at", Tue, 09 Jul 2013 21:25:58 UTC +00:00], ["project_icon_file_name", "Icon_2x.png"], ["updated_at", Tue, 09 Jul 2013 21:25:58 UTC +00:00]]