app/controllers/token_authentications_controller.rb

  def create
    @user = User.find(params[:user_id])
    generate_token(@user)
    @user.save
---
SELECT "users".* FROM "users" WHERE "users"."id" = 2 ORDER BY "users"."id" ASC LIMIT 1
UPDATE "users" SET "authentication_token" = $1 WHERE "users"."id" = 2  [["authentication_token", "mWeiuVrVm3zEkpr66qHf"]]