app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("email", "encrypted_password") VALUES ($1, $2) RETURNING "id"  [["email", "michaelfostermuse@yahoo.com"], ["encrypted_password", "$2a$10$DuFldUS7jGUWqFqKvKJ7EesO90D0GudgtBlhrxiiaP0VuD0M.U29C"]]