app/controllers/welcome_controller.rb

  def index
    redirect_to('/projects') if is_logged_in
    @app_versions = AppVersion.all
---
SELECT "app_versions".* FROM "app_versions"